PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_fmc.c
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if((addr < FMC_BASE_ADDRESS) || (addr > FMC_END_ADDRESS)) {
        HAL_DEBUGE("parameter [addr] is a invalid address.");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    if(FMC_READY == fmc_state) {
        /* set the PG bit to start program */
        FMC_CTL |= FMC_CTL_PG;

        REG16(addr) = data;

        /* wait for the FMC ready */
        fmc_state = hal_fmc_ready_wait(FMC_TIMEOUT_COUNT);

        /* reset the PG bit */
        FMC_CTL &= ~FMC_CTL_PG;
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      write flash target region with amounts of data
    \param[in]  start_addr: target region start address
    \param[in]  size: target region size
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL details refer to gd32f3x0_hal.h
*/
int32_t hal_fmc_region_write(uint32_t start_addr, uint8_t *data, uint32_t size)
{
    uint32_t counter = 0U;
    uint32_t page_offset = 0U;
    uint32_t page_addr;
    uint32_t right_align;
    uint8_t right_align_complement = 0U;
    
#if (1 == FLASH_OPER_RESERVE_ORIGINAL_DATA)
    uint32_t remaining = size;
    uint32_t write_addr_limit = ((start_addr + size) / FMC_PAGE_SIZE + 1U) * FMC_PAGE_SIZE;
    uint32_t addr_size_temp = (start_addr / FMC_PAGE_SIZE)* FMC_PAGE_SIZE ;
    uint32_t update_offset = 0U;
    uint8_t *src_addr = data;
    uint16_t write_buffer_size;
    uint8_t  non_ff_flag = 0U;
    uint32_t length, left_align;
    uint8_t single_page_flag;
    /* check whether all data is at the same page */
    if((write_addr_limit - addr_size_temp) > FMC_PAGE_SIZE) {
        single_page_flag = 0U;
    } else {
        single_page_flag = 1U;
    }
#endif /* FLASH_OPER_RESERVE_ORIGINAL_DATA */

    page_offset = start_addr - (start_addr / FMC_PAGE_SIZE) * FMC_PAGE_SIZE;

#if (1 == FLASH_OPER_RESERVE_ORIGINAL_DATA)
    /* calculate left and right align edge */
    left_align = page_offset - page_offset % 4U;
#endif /* FLASH_OPER_RESERVE_ORIGINAL_DATA */

    if((page_offset + size) % 4U) {
        right_align_complement = 4U - (page_offset + size) % 4U;
    } else {
        right_align_complement = 0U;
    }
    right_align = (page_offset + size + right_align_complement) % FMC_PAGE_SIZE;
    if(0U == right_align) {
        right_align = FMC_PAGE_SIZE;
    }

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((start_addr < FMC_BASE_ADDRESS) || (start_addr > FMC_END_ADDRESS)) {
        HAL_DEBUGE("parameter [start_addr] is a invalid address.");
        return HAL_ERR_ADDRESS;
    }
    if(NULL == data) {
        HAL_DEBUGE("parameter [data] is a NULL pointer.");
        return HAL_ERR_ADDRESS;
    }
    if(size > (FMC_END_ADDRESS - start_addr)) {
        HAL_DEBUGE("target data size exceed flash atual address scope.");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* save the original data , erase responding page */
    /* save the original data in the processing of writing data */
#if (1 == FLASH_OPER_RESERVE_ORIGINAL_DATA)
    do {
        for(counter = 0; counter < FMC_PAGE_SIZE; counter++) {
            _g_fmc_cache[counter] = 0xFFU;
        }
        page_addr = (start_addr / FMC_PAGE_SIZE) * FMC_PAGE_SIZE;
        page_offset = start_addr - page_addr;

        /* get the currently transmitting data length */
        if(page_offset + remaining < FMC_PAGE_SIZE) {
            length = remaining;
        } else {
            length = FMC_PAGE_SIZE - page_offset;
        }

        if(1U == single_page_flag) {
            /* process the condition that all data is at the same page */
            update_offset = left_align;
            write_buffer_size = right_align - left_align;
            /* check whether target region content is 0xFF */
            for(counter = left_align; counter < right_align; counter++) {
                if(0xFF != REG8(page_addr + counter)) {
                    non_ff_flag = 1U;
                    break;
                }
            }
            /* backup the orignal data and erase the page */
            if(1U == non_ff_flag) {
                for(counter = 0; counter < left_align; counter++) {
                    if(0xFF != REG8(page_addr + counter)) {
                        update_offset = counter;
                        write_buffer_size = right_align - counter;
                        break;
                    }
                }

                for(counter = FMC_PAGE_SIZE - 1U; counter >= right_align; counter--) {
                    if(0xFF != REG8(page_addr + counter)) {
                        write_buffer_size = counter - update_offset + 1U;
                        break;
                    }
                }
                memcpy((uint8_t *)(_g_fmc_cache + update_offset), (uint8_t *)(page_addr + update_offset), write_buffer_size);
                _fmc_page_erase(page_addr);
                non_ff_flag = 0U;
            }
        } else {
            /* process the condition that all data cover more than one page */
            if(page_addr == (write_addr_limit - FMC_PAGE_SIZE)) {
                /* process the data in last page */
                update_offset = page_offset;
                write_buffer_size = right_align;
                /* check whether target region content is 0xFF */
                for(counter = 0; counter < right_align; counter++) {
                    if(0xFF != REG8(page_addr + counter)) {
                        non_ff_flag = 1U;
                        break;
                    }
                }
                /* backup the orignal data and erase the page */
                if(1U == non_ff_flag) {
                    for(counter = FMC_PAGE_SIZE - 1U; counter >= right_align; counter--) {
                        if(0xFF != REG8(page_addr + counter)) {
                            write_buffer_size = counter + 1U;
                            break;
                        }
                    }
                    /* load from the flash into the cache */
                    memcpy((uint8_t *)(_g_fmc_cache), (uint8_t *)(page_addr), write_buffer_size);
                    /* erase the page, and write the cache */
                    _fmc_page_erase(page_addr);
                    non_ff_flag = 0U;
                }
            } else {
                /* process the data in middle pages */
                if(page_addr == start_addr) {
                    update_offset = 0U;
                    write_buffer_size = FMC_PAGE_SIZE;
                    /* check whether target region content is 0xFF */
                    for(counter = 0U; counter <  FMC_PAGE_SIZE; counter++) {
                        if(0xFF != REG8(page_addr + counter)) {
                            non_ff_flag = 1U;
                            break;
                        }
                    }
                    /* erase the page if it is necessary */
                    if(1U == non_ff_flag) {
                        _fmc_page_erase(page_addr);
                        non_ff_flag = 0U;
                    }
                } else {
                    update_offset = left_align;
                    write_buffer_size = FMC_PAGE_SIZE - update_offset;
                    /* process the data in first page */
                    /* check whether target region content is 0xFF */
                    for(counter = left_align; counter < FMC_PAGE_SIZE; counter++) {
                        if(0xFF != REG8(page_addr + counter)) {
                            non_ff_flag = 1U;
                            break;
                        }
                    }
                    /* backup the orignal data and erase the page */
                    if(1U == non_ff_flag) {
                        for(counter = 0; counter < left_align; counter++) {
                            if(0xFF != REG8(page_addr + counter)) {
                                update_offset = counter;
                                write_buffer_size = FMC_PAGE_SIZE - update_offset;
                                break;
                            }
                        }
                        /* load from the flash into the cache */
                        memcpy((uint8_t *)(_g_fmc_cache + update_offset), (uint8_t *)(page_addr + update_offset), \
                               write_buffer_size);
                        /* erase the page, and write the cache */
                        _fmc_page_erase(page_addr);
                        non_ff_flag = 0U;
                    }
                }
            }
        }

