PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_fmc.c
        /* update the cache from the source */
        memcpy((uint8_t *)_g_fmc_cache + page_offset, src_addr, length);

        _fmc_program_align_word(page_addr + update_offset, (uint8_t *)(_g_fmc_cache + update_offset), write_buffer_size);
        start_addr += length;
        src_addr += length;
        remaining -= length;

    } while(remaining > 0);
#else
    while(counter < size) {
        if(0xffU == (REG8(start_addr + counter))) {
            counter++;
        } else {
            /* erase the pgae unless all the original data is 0xFF */
            page_addr = ((start_addr + counter) / FMC_PAGE_SIZE) * FMC_PAGE_SIZE;
            _fmc_page_erase(page_addr);
            counter++;
        }
    }
    /* save the original data which is outside the writing target range */
    _fmc_program_align_word(start_addr, data, size);
#endif /* save the original data which is outside the writing target range */
    return HAL_ERR_NONE;
}

/*!
    \brief      erase the page which start address locating in
    \param[in]  start_addr: target region start address
    \param[out] none
    \retval     fmc_state_enum: state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_OB_HSPC: option byte security protection code high
*/
fmc_state_enum hal_fmc_page_erase(uint32_t start_addr)
{
    fmc_state_enum state;
    uint32_t page_offset = 0U;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if((start_addr < FMC_BASE_ADDRESS) || (start_addr > FMC_END_ADDRESS)) {
        HAL_DEBUGE("parameter [start_addr] is a invalid address.");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    page_offset = start_addr % FMC_PAGE_SIZE;
    state = _fmc_page_erase(start_addr - page_offset);
    return(state);
}

/*!
    \brief      erase the whole flash
    \param[in]  none
    \param[out] none
    \retval     fmc_state_enum: state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_OB_HSPC: option byte security protection code high
*/
fmc_state_enum hal_fmc_mass_erase(void)
{
    fmc_state_enum fmc_state = hal_fmc_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state) {
        /* start chip erase */
        FMC_CTL |= FMC_CTL_MER;
        FMC_CTL |= FMC_CTL_START;

        /* wait for the FMC ready */
        fmc_state = hal_fmc_ready_wait(FMC_TIMEOUT_COUNT);

        /* reset the MER bit */
        FMC_CTL &= ~FMC_CTL_MER;
    }

    /* return the fmc state  */
    return fmc_state;
}

/*!
    \brief      erase flash target region
    \param[in]  start_addr: target region start address
    \param[in]  size: target region size
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL details refer to gd32f3x0_hal.h
*/
int32_t hal_fmc_region_erase(uint32_t start_addr, uint32_t size)
{
    uint32_t page_offset, page_number, counter = 0U;
    uint32_t page_addr;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((start_addr < FMC_BASE_ADDRESS) || (start_addr > FMC_END_ADDRESS)) {
        HAL_DEBUGE("parameter [start_addr] is a invalid address.");
        return HAL_ERR_ADDRESS;
    }
    if(size > (FMC_END_ADDRESS - start_addr)) {
        HAL_DEBUGE("target data size exceed flash atual address scope.");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    page_offset = start_addr % FMC_PAGE_SIZE;
    if((size + page_offset) % FMC_PAGE_SIZE) {
        page_number = (size + page_offset) / FMC_PAGE_SIZE + 1U;
    } else {
        page_number = (size + page_offset) / FMC_PAGE_SIZE;
    }
    page_addr = start_addr - page_offset;
#if (1 == FLASH_OPER_RESERVE_ORIGINAL_DATA)
    /* page nubmer which buffer refer is equal to one */
    if(1U == page_number) {
        _fmc_page_erase_update(_g_fmc_cache, size, page_addr, page_offset);
    } else if(2U == page_number) {
        /* page nubmer which buffer refer is equal to two */
        _fmc_page_erase_update(_g_fmc_cache, FMC_PAGE_SIZE - page_offset, \
                               page_addr, page_offset);

        _fmc_page_erase_update(_g_fmc_cache, page_offset + size - FMC_PAGE_SIZE, \
                               page_addr + FMC_PAGE_SIZE, 0);

    } else {
        /* page nubmer which buffer refer is more than two */
        _fmc_page_erase_update(_g_fmc_cache, FMC_PAGE_SIZE - page_offset, \
                               page_addr, page_offset);

        /* erase middle pages */
        for(counter = 1; counter < (page_number - 1U); counter++) {
            _fmc_page_erase(page_addr + (FMC_PAGE_SIZE * counter));
        }
        counter = (page_offset + size) % FMC_PAGE_SIZE;
        if(0U == counter) {
            counter = FMC_PAGE_SIZE;
        }
        _fmc_page_erase_update(_g_fmc_cache, counter, \
                               page_addr + (FMC_PAGE_SIZE * (page_number - 1U)), 0);
    }
#else
    /* erase all the pages which buffer refer */
    for(counter = 0U; counter < page_number; counter++) {
        _fmc_page_erase(page_addr + (counter * FMC_PAGE_SIZE));
    }
#endif /* save the original data which is outside the erasing target range */
    return HAL_ERR_NONE;
}

/*!
    \brief      fmc interrupt handler content function, which is merely used in fmc_handler
    \param[in]  p_irq: pointer to fmc interrupt handler callback function
    \param[out] none
    \retval     none
*/
void hal_fmc_irq(void)
{
    if(SET == _fmc_interrupt_flag_get(FMC_FLAG_PGERR | FMC_FLAG_WPERR)) {
        _fmc_interrupt_flag_get(FMC_FLAG_PGERR | FMC_FLAG_WPERR);
        if(p_irq->error_handle != NULL) {
            p_irq->error_handle(p_irq);
        }
    }

