PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_fmc.c
                /* enable the option bytes programming */
                FMC_CTL |= FMC_CTL_OBPG;

                _ob_value_modify(address, (uint16_t)ob_data, &ob_parm);
                /* wait for the FMC ready */
                fmc_state = hal_fmc_ready_wait(FMC_TIMEOUT_COUNT);

                if(FMC_TOERR != fmc_state) {
                    /* reset the OBPG bit */
                    FMC_CTL &= ~FMC_CTL_OBPG;
                }
            } else {
                if(FMC_TOERR != fmc_state) {
                    /* reset the OBER bit */
                    FMC_CTL &= ~FMC_CTL_OBER;
                }
            }
        }
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      enable the targeted address region written protection
    \param[in]  start_addr: target region start address
    \param[in]  data_size: target region size
    \param[out] none
    \retval     sector_addr_range_struct: actual start and end address
*/
hal_sector_addr_range_struct hal_ob_wp_enable(uint32_t start_addr, uint32_t data_size)
{
    uint8_t index, counter, sub_counter;
    hal_sector_addr_range_struct sector;
    uint16_t wp_temp0 = (uint16_t)REG8(OB + 8U);
    uint16_t wp_temp1 = (uint16_t)(REG8(OB + 0xaU) << 8U);
    uint16_t wp_prev = wp_temp0 | wp_temp1;
    uint16_t wp = 0U;
    uint16_t wp_sector = 1U ;
    uint8_t sector_number;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((start_addr < FMC_BASE_ADDRESS) || (start_addr > FMC_END_ADDRESS)) {
        HAL_DEBUGE("parameter [start_addr] is a invalid address.");
    }
    if(data_size > (FMC_END_ADDRESS - start_addr)) {
        HAL_DEBUGE("target data size exceed flash atual address scope.");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    index = (start_addr & 0x000f000U) >> 12U;
    if(data_size % FMC_SECTOR_SIZE) {
        sector_number = data_size / FMC_SECTOR_SIZE + 1U;
    } else {
        sector_number = data_size / FMC_SECTOR_SIZE;
    }
    for(counter = 0U; counter < sector_number ; counter++) {
        for(sub_counter = 0U; sub_counter < (index + counter); sub_counter++) {
            wp_sector = 2U * wp_sector;
        }
        wp = wp + wp_sector;
        wp_sector = 1U;
    }
    /* check current write protection sector, if there is confict, erase option byte */
    if(((0xFFU != (uint8_t)wp_prev) && (0U != (uint8_t)wp)) || ((0xFFU != (uint8_t)(wp_prev >> 8U)) && (0 != (uint8_t)(wp >> 8U)))) {
        wp = wp | (~wp_prev);
        hal_ob_erase();
    }
    /* enable the target sector write protected */
    hal_ob_write_protection_enable(wp);

    /* define actual address range which is writen protected */
    sector.sector_start_addr = FMC_BASE_ADDRESS + index * FMC_SECTOR_SIZE;
    sector.sector_end_addr = sector.sector_start_addr + sector_number * FMC_SECTOR_SIZE;

    return(sector);
}

/*!
    \brief      disable the targeted address region written protection
    \param[in]  start_addr: target region start address
    \param[in]  data_size: target region size
    \param[out] none
    \retval     sector_addr_range_struct: actual start and end address
*/
hal_sector_addr_range_struct hal_ob_wp_disable(uint32_t start_addr, uint32_t data_size)
{
    uint8_t index, counter, sub_counter;
    hal_sector_addr_range_struct sector;
    uint16_t wp_temp0 = (uint16_t)REG8(OB + 8U);
    uint16_t wp_temp1 = (uint16_t)(REG8(OB + 0xaU) << 8U);
    uint16_t wp_prev = wp_temp0 | wp_temp1;

    uint16_t wp = 0U;
    uint16_t wp_sector = 1U ;
    uint8_t page_number;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((start_addr < FMC_BASE_ADDRESS) || (start_addr > FMC_END_ADDRESS)) {
        HAL_DEBUGE("parameter [start_addr] is a invalid address.");
    }
    if(data_size > (FMC_END_ADDRESS - start_addr)) {
        HAL_DEBUGE("target data size exceed flash atual address scope.");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    index = (start_addr & 0x000f000U) >> 12U;
    if(data_size % FMC_SECTOR_SIZE) {
        page_number = data_size / FMC_SECTOR_SIZE + 1U;
    } else {
        page_number = data_size / FMC_SECTOR_SIZE;
    }

    for(counter = 0U; counter < page_number ; counter++) {
        for(sub_counter = 0U; sub_counter < (index + counter); sub_counter++) {
            wp_sector = 2U * wp_sector;
        }
        wp = wp + wp_sector;
        wp_sector = 1U;
    }
    /* disable the target sector write protected */
    wp = (~wp) & (~wp_prev);

    hal_ob_erase();

    hal_ob_write_protection_enable(wp);

    /* define actual address range which is writen protected */
    sector.sector_start_addr = FMC_BASE_ADDRESS + index * FMC_SECTOR_SIZE;
    sector.sector_end_addr = sector.sector_start_addr + page_number * FMC_SECTOR_SIZE;

    return(sector);
}

/*!
    \brief      get option byte parameters, which are stored in register FMC_OBSTAT and FMC_WP
    \param[in]  p_parm: pointer to currently valid option byte parameters
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL details refer to gd32f3x0_hal.h
*/
int32_t hal_ob_parm_get(ob_parm_struct *p_parm)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == p_parm) {
        HAL_DEBUGE("parameter [p_parm] is a NULL pointer.");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* get the information of option byte */
    p_parm->data0 = (uint8_t)(FMC_OBSTAT >> 16U);
    p_parm->data1 = (uint8_t)(FMC_OBSTAT >> 24U);
    p_parm->user = (uint8_t)(FMC_OBSTAT >> 8U);
    p_parm->spc = (FMC_OBSTAT & (FMC_OBSTAT_PLEVEL_BIT0 | FMC_OBSTAT_PLEVEL_BIT1));
    p_parm->wp0 = (uint8_t)(FMC_WP);
    p_parm->wp1 = (uint8_t)(FMC_WP >> 8);

    return HAL_ERR_NONE;
}
/*!
    \brief      enable option byte write protection(OB_WP) depending on current option byte
    \param[in]  ob_wp: write protection configuration data
                       setting the bit of ob_wp means enabling the corresponding sector write protection
    \param[out] none
    \retval     fmc_state
*/
fmc_state_enum hal_ob_write_protection_enable(uint16_t ob_wp)
{
    uint8_t ob_wrp0, ob_wrp1;
    ob_parm_struct ob_parm;
    fmc_state_enum fmc_state = hal_fmc_ready_wait(FMC_TIMEOUT_COUNT);
    hal_ob_parm_get(&ob_parm);
    ob_wp   = (uint16_t)(~ob_wp);
    ob_wrp0 = (uint8_t)(ob_wp & OB_LWP);
    ob_wrp1 = (uint8_t)((ob_wp & OB_HWP) >> 8U);

    if(0xFFFFU == OB_WP0) {
        if(0xFFFFU == OB_WP1) {
            if(FMC_READY == fmc_state) {
                /* set the OBPG bit*/
                FMC_CTL |= FMC_CTL_OBPG;

                if(0xFFU != ob_wrp0) {
                    OB_WP0 = ob_wrp0 ;
                    /* wait for the FMC ready */
                    fmc_state = hal_fmc_ready_wait(FMC_TIMEOUT_COUNT);
                }

                if((FMC_READY == fmc_state) && (0xFFU != ob_wrp1)) {
                    OB_WP1 = ob_wrp1 ;
                    /* wait for the FMC ready */
                    fmc_state = hal_fmc_ready_wait(FMC_TIMEOUT_COUNT);
                }

                if(FMC_TOERR != fmc_state) {
                    /* reset the OBPG bit */
                    FMC_CTL &= ~FMC_CTL_OBPG;
                }
            }
        }
    } else {
        if(FMC_READY == fmc_state) {
            /* start erase the option byte */
            FMC_CTL |= FMC_CTL_OBER;
            FMC_CTL |= FMC_CTL_START;

            /* wait for the FMC ready */
            fmc_state = hal_fmc_ready_wait(FMC_TIMEOUT_COUNT);

            if(FMC_READY == fmc_state) {

                /* reset the OBER bit */
                FMC_CTL &= ~FMC_CTL_OBER;

