PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_fmc.c
                /* enable the option bytes programming */
                FMC_CTL |= FMC_CTL_OBPG;

                _ob_value_modify(OB_WP_ADDR0, ob_wp, &ob_parm);
                /* wait for the FMC ready */
                fmc_state = hal_fmc_ready_wait(FMC_TIMEOUT_COUNT);

                if(FMC_TOERR != fmc_state) {
                    /* reset the OBPG bit */
                    FMC_CTL &= ~FMC_CTL_OBPG;
                }
            } else {
                if(FMC_TOERR != fmc_state) {
                    /* reset the OBER bit */
                    FMC_CTL &= ~FMC_CTL_OBER;
                }
            }
        }
    }
    /* return the FMC state */
    return fmc_state;
}
/*!
    \brief      configure option byte parameters thoroughly
    \param[in]  ob_parm: pointer to option byte struct used to configure its parameters
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL details refer to gd32f3x0_hal.h
*/
int32_t hal_ob_parm_config(hal_ob_parm_config_struct *ob_parm)
{

    uint8_t spc = 0xA5U;
    uint8_t user = 0xFFU;
    uint16_t data = 0xFFFFU;
    uint16_t wp = 0xFFFFU;
    uint8_t wp_flag = 0U;
    uint64_t ob_parameter = 0U;
    uint32_t data_temp0, data_temp1, wp_temp0, wp_temp1;
    fmc_state_enum fmc_state;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == ob_parm) {
        HAL_DEBUGE("parameter [ob_parm] is a NULL pointer.");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* unlock flash and option byte */
    hal_fmc_unlock();
    hal_ob_unlock();

    /* check whether spc is default value */
    if(OB_SPC != spc) {
        spc = OB_SPC;
    }
    /* check whether user is default value */
    if(OB_USER != user) {
        user = OB_USER;
    }
    /* check whether data is default value */
    if((OB_DATA0 != (uint8_t)data) || (OB_DATA1 != (uint8_t)(data >> 8U))) {
        data_temp0 = (uint16_t) OB_DATA0;
        data_temp1 = (uint16_t)(OB_DATA1 << 8U);
        data = data_temp0 | data_temp1;
    }
    /* check whether WP is default value */
    if((OB_WP0 != (uint8_t)wp) || (OB_WP1 != (uint8_t)(wp >> 8U))) {
        wp_temp0 = (uint16_t) OB_WP0;
        wp_temp1 = (uint16_t)(OB_WP1 << 8U);
        wp = wp_temp0 | wp_temp1;
        wp_flag = 1U;
    }
    /* write protection process */
    if(ob_parm->ob_type & OB_TYPE_WP) {
        if(OB_WP_ENABLE == ob_parm->wp_state) {
            hal_ob_wp_enable(ob_parm->wp_addr, ob_parm->wp_size);
            wp_temp0 = (uint16_t) OB_WP0;
            wp_temp1 = (uint16_t)(OB_WP1 << 8U);
            wp = wp_temp0 | wp_temp1;
            wp_flag = 0U;
        } else {
            hal_ob_wp_disable(ob_parm->wp_addr, ob_parm->wp_size);
            wp_temp0 = (uint16_t) OB_WP0;
            wp_temp1 = (uint16_t)(OB_WP1 << 8U);
            wp = wp_temp0 | wp_temp1;
            wp_flag = 0U;
        }
    }
    /* security protection process */
    if(ob_parm->ob_type & (OB_TYPE_SPC | OB_TYPE_USER | OB_TYPE_DATA)) {
        wp_flag = 1U;
        if(ob_parm->ob_type & OB_TYPE_SPC) {
            spc = ob_parm->spc_level;
        }
        if(ob_parm->ob_type & OB_TYPE_USER) {
            user &= ob_parm->user;
        }
        if(ob_parm->ob_type & OB_TYPE_DATA) {
            data = ob_parm->data_value;
        }

        ob_parameter = ((uint64_t)spc | (uint64_t)(user << 16U) | (uint64_t)((uint8_t)data) << 32U
                        | (uint64_t)(data >> 8U) << 48U);

        /* start erase the option byte */
        FMC_CTL |= FMC_CTL_OBER;
        FMC_CTL |= FMC_CTL_START;
        /* wait for the FMC ready */
        fmc_state = hal_fmc_ready_wait(FMC_TIMEOUT_COUNT);

        if(FMC_READY == fmc_state) {

            /* reset the OBER bit */
            FMC_CTL &= ~FMC_CTL_OBER;

            /* enable the option bytes programming */
            FMC_CTL |= FMC_CTL_OBPG;


            OB_SPC = (uint16_t)ob_parameter;
            OB_USER = (uint16_t)(ob_parameter >> 16U);
            OB_DATA0 = (uint16_t)(ob_parameter >> 32U);
            OB_DATA1 = (uint16_t)(ob_parameter >> 48U);

            /* wait for the FMC ready */
            fmc_state = hal_fmc_ready_wait(FMC_TIMEOUT_COUNT);

            if(FMC_TOERR != fmc_state) {
                /* reset the OBPG bit */
                FMC_CTL &= ~FMC_CTL_OBPG;
            }
        } else {
            if(FMC_TOERR != fmc_state) {
                /* reset the OBER bit */
                FMC_CTL &= ~FMC_CTL_OBER;
            }
        }

    }
    /* if previously actual option byte value exist, write it back */
    if(1U == wp_flag) {
        hal_ob_write_protection_enable(~wp);
    }
    /* lock flash and option byte */
    hal_ob_lock();
    hal_fmc_lock();

    return HAL_ERR_NONE;
}

#if (1 == FLASH_OPER_RESERVE_ORIGINAL_DATA)
/*!
    \brief      write target data aligned in word
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  size: target region size
    \param[in]  page_addr: page head address
    \param[in]  page_offset: the offset with respect to page head address
    \param[out] none
    \retval     none
*/
static void _fmc_page_erase_update(uint8_t *p_buffer, uint32_t size, uint32_t page_addr, \
                                   uint32_t page_offset)
{
    uint32_t temp;
    uint32_t counter;
    uint32_t update_index = 0U;

    temp = (uint32_t)p_buffer;

    for(counter = 0U; counter < FMC_PAGE_SIZE; counter += 4) {
        if(0xFFFFFFFF != REG32(page_addr + counter)) {
            update_index = counter;
            break;
        }
    }

    if(FMC_PAGE_SIZE != counter) {
        for(counter = update_index; counter < FMC_PAGE_SIZE; counter += 4) {
            REG32(temp + counter) = REG32(page_addr + counter);
        }

        /* configure the target region to 0xFF */
        for(counter = 0U; counter < size; counter++) {
            p_buffer[page_offset + counter] = 0xFFU;
        }

        _fmc_page_erase(page_addr);

        /* write the orignal data to address outside the target range */
        temp = (uint32_t)p_buffer;
        for(counter = update_index; counter < FMC_PAGE_SIZE; counter += 4) {
            hal_fmc_word_program(page_addr + counter, REG32(temp + counter));
        }
    }
}
#endif /* FLASH_OPER_RESERVE_ORIGINAL_DATA */

/*!
    \brief      write target data aligned in word
    \param[in]  start_addr: target region start address
    \param[in]  data: pointer to target data
    \param[in]  data_size: target region size
    \param[out] none
    \retval     none
*/
static void _fmc_program_align_word(uint32_t dst_addr, uint8_t *data, uint32_t data_size)
{
    uint32_t head_offset, tail_offset, data_offset;
    uint32_t data_addr_align, data_size_align;
    uint32_t counter;
    uint32_t temp_addr;
    uint8_t align_buffer[4] = {0xFF, 0xFF, 0xFF, 0xFF};

    head_offset = dst_addr % 4U;
    tail_offset = (data_size + head_offset) % 4U;

    if(0 != head_offset) {
        /* write the target region if front address is non-aligned */
        data_addr_align = dst_addr + (4 - head_offset);
        data_size_align = data_size - (4 - head_offset);

        temp_addr = (uint32_t)data;
        for(counter = head_offset; counter < 4; counter++) {
            align_buffer[counter] = REG8(temp_addr);
            temp_addr++;
        }
        data_offset = 4 - head_offset;
        hal_fmc_word_program(dst_addr - head_offset, REG32(align_buffer));
    } else {
        /* write the target region aligned address */
        data_addr_align = dst_addr;
        data_size_align = data_size;
        data_offset = 0;
    }
    /* write the target region if back address is non-aligned */
    if(0 != tail_offset) {
        data_size_align = data_size - tail_offset;

        temp_addr = (uint32_t)data;
        temp_addr = temp_addr + data_size - tail_offset;
        for(counter = 0; counter < tail_offset; counter++) {
            align_buffer[counter] = REG8(temp_addr);
            temp_addr++;
        }

        hal_fmc_word_program(dst_addr + data_size - tail_offset, REG32(align_buffer));
    }
    /* write the target region middle aligned address */
    temp_addr = (uint32_t)data + data_offset;
    for(counter = 0; counter < data_size_align; counter += 4) {
        hal_fmc_word_program(data_addr_align + counter, REG32(temp_addr + counter));
    }
}

/*!
    \brief      erase page
    \param[in]  page_address: target page start address
    \param[out] none
    \retval     fmc_state
*/
fmc_state_enum _fmc_page_erase(uint32_t page_address)
{
    fmc_state_enum fmc_state = hal_fmc_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state) {
        /* start page erase */
        FMC_CTL |= FMC_CTL_PER;
        FMC_ADDR = page_address;
        FMC_CTL |= FMC_CTL_START;

        /* wait for the FMC ready */
        fmc_state = hal_fmc_ready_wait(FMC_TIMEOUT_COUNT);

        /* reset the PER bit */
        FMC_CTL &= ~FMC_CTL_PER;
    }

    /* return the FMC state  */
    return fmc_state;
}

/*!
    \brief      modify the target option byte depending on the original value
    \param[in]  address: target option byte address
    \param[in]  value: target option byte value
    \param[in]  ob_parm: pointer to option byte parameter struct
    \param[out] none
    \retval     none
*/
void _ob_value_modify(uint32_t address, uint16_t value, ob_parm_struct *ob_parm)
{
    uint8_t spc, user, data0, data1, wp0, wp1;
    /* store the original option bytes */
    spc = ob_parm->spc;
    user = ob_parm->user;
    data0 = ob_parm->data0;
    data1 = ob_parm->data1;
    wp0 = ob_parm->wp0;
    wp1 = ob_parm->wp1;

    /* bring in the target option byte */
    if(OB_SPC_ADDR == address) {
        spc = (uint8_t)value;
    } else if(OB_DATA_ADDR0 == address) {
        data0 = (uint8_t)value;
    } else if(OB_DATA_ADDR1 == address) {
        data1 = (uint8_t)value;
    } else if(OB_USER_ADDR == address) {
        user =  user & (uint8_t)value;
    } else {
        wp0 = wp0 & ((uint8_t)(value));
        wp1 = wp1 & ((uint8_t)(value >> 8U));
    }
    /* basing on original value, modify the target option byte */
    OB_SPC = spc;
    OB_USER = user;
    if(0xFFU != data0) {
        OB_DATA0 = data0;
    }
    if(0xFFU != data1) {
        OB_DATA1 = data1;
    }
    if(0xFFU != wp0) {
        OB_WP0 = wp0;
    }
    if(0xFFU != wp1) {
        OB_WP1 = wp1;
    }
}

/*!
    \brief      get the FMC state
    \param[in]  none
    \param[out] none
    \retval     fmc_state
*/
fmc_state_enum _fmc_state_get(void)
{
    fmc_state_enum fmc_state = FMC_READY;

